@extends('layouts.static')

@section('title', 'Обработка персональных данных')

@section('content')
    <div class="container">
        <x-common.h1>
            Согласие на обработку персональных данных
        </x-common.h1>

		<div class="px-lg-120 text-justify">
			<p class="mt-3">
				В соответствии с требованиями Федерального закона от 27.07.2006 г. № 152-ФЗ «О персональных данных» я даю своё
				согласие АО «Точка» (место нахождения: 109240, г.Москва, ул.Радищевская верхн., д.2/1, строение 5, пом.I, эт.3,
				ком.4) (далее — Оператор) на обработку, сбор, запись, систематизацию, накопление, хранение, уточнение,
				обновление, изменение, извлечение, использование, передачу, обезличивание, блокирование и удаление моих
				персональных данных, совершаемую c использованием средств автоматизации или без них.
			</p>
	
			<p>
				Даю согласие на обработку моих персональных данных, включая фамилию, имя, отчество, дату и место рождения, пол,
				данные документа, удостоверяющего личность (сведения о его номере, дате выдачи, выдавшем его органе и др.),
				данные о гражданстве, адресе проживания, семейном, социальном, имущественном положении, образовании, профессии,
				доходах, месте работы, контактных данных (номер телефона, адрес электронной почты), ИНН, СНИЛС.
			</p>
	
	
			<p>
				Согласие на обработку персональных данных дается с целью:
			<ul>
				<li>рассмотрение Оператором заявки на заключение договора;</li>
				<li>передачи Оператором заявки на открытие расчетного счета Банкам-партнерам;</li>
				<li>консультирования и информирования по предоставляемым Оператором, Банком-партнером, Партнерам услугам;</li>
				<li>распространения рекламы Оператора, Банков-партнеров и Партнеров;</li>
				<li>проведения проверочных мероприятий в отношении меня с целью оценки моей благонадежности, в том числе в целях
					выполнения требований нормативных актов по противодействию легализации денежных средств, полученных
					преступным путем;</li>
				<li>получение информации от операторов связи обо мне как абоненте, ставшей известной операторам связи в силу
					исполнения ими договоров об оказании услуг связи, заключенных со мной;</li>
			</ul>
			</p>
	
			<p>
				Разрешаю Оператору передать мои персональные данные (фамилию, имя, отчество, дату и место рождения, пол, данные
				документа, удостоверяющего личность (сведения о его номере, дате выдачи, выдавшем его органе и др.), данные о
				гражданстве, адресе проживания, семейном, социальном, имущественном положении, образовании, профессии, доходах,
				месте работы, контактных данных (номер телефона, адрес электронной почты), ИНН, СНИЛС) Банкам-партнерам.
			</p>
	
			<p>
				Срок, в течение которого действует настоящее Согласие, составляет 3 года.
			</p>
			<p>
				Отзыв настоящего согласия может быть произведен в соответствии с действующим законодательством РФ в форме
				письменного заявления на отзыв согласия на обработку персональных данных. В случае отзыва согласия на обработку
				персональных данных Оператор обязан прекратить их обработку в срок, не превышающий тридцати дней с даты
				поступления указанного отзыва.
			</p>
			<p>
				Оставляя свои данные в отправляемой мной заявке и предоставляя дополнительные данные и документы по телефону,
				факсу или электронной почте, я подтверждаю и признаю, что я прочитал изложенное соглашение, и даю своё
				безусловное согласие без оговорок и ограничений.
			</p>
		</div>
    </div>
@endsection
