<style>
	.contract__table {margin: 0 0 15px 0;width: 100%;border-collapse: collapse;border-spacing: 0;}		
	.contract__table td, .contract__table th {
		padding: 5px;
		border: 1px solid #3a3a3a;
		text-align: center;
	}
	.contract__h3 {
		margin: 0 0 10px 0;
		padding: 10px 0;
		font-weight: bold;
		font-size: 24px;
		text-align: center;
	}
	.contract__h4 {
		margin: 0 0 10px 0;
		padding: 10px 0;
		font-weight: bold;
		font-size: 16px;
		text-align: center;
	}
	.contract__h5 {text-align: center;}	
	.contract__table-wrap {
		overflow: auto;
	}
	.contract__page-break {
		page-break-after: always;
	}
	.contract__p {
		line-height: 1.3;
	}
</style>

<h3 class="contract__h3">ОФЕРТА</h3>
<h5 class="contract__h5">1. ОБЩИЕ ПОЛОЖЕНИЯ</h5>
{{-- //TODO Gen dir name --}}
<p class="contract__p">1.1. В соответствии со статьей 435 Гражданского кодекса Российской Федерации настоящая оферта (далее – «Оферта»,
    «Договор») является официальным предложением {{ settings()->organization_title }}, именуемого в дальнейшем по тексту
    «Агент», в лице Генерального директора ______, действующего на основании Устава, адресованным «Принципалам» -
    юридическим лицам и индивидуальным предпринимателям (включая филиалы и представительства), и содержит все
    существенные условия взаимодействия Агента и Принципала, совместно именуемых «Стороны», а по отдельности «Сторона»,
    при взаимодействии в рамках настоящего Договора.</p>
<p class="contract__p">1.2. Настоящая Оферта не является публичной офертой по смыслу статьи 437 Гражданского кодекса Российской Федерации.
    Настоящий Договор по смыслу ст. 428 Гражданского кодекса Российской Федерации является договором присоединения,
    условия которого определены Агентом по тексту настоящей Оферты, и которые могут быть приняты Принципалом путем
    присоединения к настоящей Оферте в целом в порядке, предусмотренном п. 1.4 Договора.</p>
<p class="contract__p">1.3. Стороной настоящего Договора на стороне Принципала может быть только юридическое лицо или индивидуальный
    предприниматель.</p>
<p class="contract__p">1.4. Принятием условий (акцептом) Оферты при соблюдении условия, указанного в п. 1.3 Договора, считается совершение
    совокупности следующих действий: заполнение электронной формы, размещенной по адресу: {{ env('APP_URL') }},
    проставление согласия в поле «Я принимаю условия Оферты», проставление согласия в поле «Я принимаю условия
    Пользовательского соглашения», отправка данных сведений посредством нажатия на поле «Отправить», внесение Платежа на
    закупку Товара. </p>
<p class="contract__p">1.5. До принятия условий (акцепта) Оферты Принципалу надлежит ознакомиться с настоящей Офертой. В случае несогласия с
    условиями Оферты в целом или какой-либо ее частью Принципалу надлежит воздержаться от ее принятия (акцепта Оферты).
</p>
<h5 class="contract__h5">2. ТЕРМИНЫ </h5>
<p class="contract__p">2.1. <strong>Вознаграждение Агента</strong> – как оно определено в соответствии с п. 4.1 Договора. </p>
<p class="contract__p">2.2. <strong>Выручка</strong> – сумма денежных средств, полученных Агентом от Покупателей от продажи Товаров в рамках
    выполнения поручения по Договору. </p>
<p class="contract__p">2.3. <strong>Дополнительная выгода</strong> – сумма денежных средств, полученная Агентом при совершении сделки с
    Покупателем, составляющая превышение Минимальной цены продажи.</p>
<p class="contract__p">2.4. <strong>Закупочная цена</strong> – цена, по которой Агент покупает Товар у Продавца.</p>
<p class="contract__p">2.5. <strong>Личный кабинет</strong> – часть Платформы, доступ Принципала к которой осуществляется с использованием
    Учетной записи. Принципал использует функционал Платформы через Личный кабинет. Условия использования Личного
    кабинета установлены в Пользовательском соглашении.</p>
<p class="contract__p">2.6. <strong>Минимальная цена продажи</strong> – минимальная цена сделки, по которой Агент обязуется реализовывать
    Товар Покупателям, определяется по формуле: Закупочная цена + Х %, где Х это Наценка, размер которой определяется в
    зависимости от выбранных Принципалом Условий поручения.</p>
<p class="contract__p">2.7. <strong>Наценка</strong> – составная часть Минимальной цены продажи, определяемая в процентах от Платежа на
    закупку Товара.</p>
<p class="contract__p">2.8. <strong>Ожидаемая прибыль Принципала</strong> – сумма денежных средств, полученная Агентом от реализации Товара
    Покупателям, за вычетом Закупочной цены и Вознаграждения Агента.</p>
<p class="contract__p">2.9. <strong>Период поручения</strong> – период, в течение которого Агент исполняет поручение, равный количеству
    Циклов закупки и определяемый в Условиях поручения.</p>
<p class="contract__p">2.10. <strong>Платеж на закупку Товара</strong> – сумма денежных средств, которую Принципал перечисляет Агенту для
    целей совершения сделок с Продавцами. Размер Платежа на закупку Товара определяется в соответствии с Условиями
    поручения. После выбора одного из вариантов Условий поручения в Личном кабинете Принципал самостоятельно определяет
    размер Платежа на закупку Товара в диапазоне, заданном выбранными Условиями поручения.</p>
<p class="contract__p">2.11. <strong>Платформа</strong> – составное произведение, основной частью которого является программа для ЭВМ.
    Правообладателем Платформы является Агент. Функционал Платформы позволяет Принципалу осуществлять, включая, но не
    ограничиваясь, следующие действия:</p>
<p class="contract__p">2.11.1. Посредством Личного кабинета устанавливать и менять Условия поручения посредством выбора из предложенных
    вариантов.</p>
<p class="contract__p">2.11.2. Инициировать досрочное расторжение Договора.</p>
<p class="contract__p">2.11.3. Осуществлять обмен информацией и документами с Агентом.</p>
<p class="contract__p">2.12. <strong>Покупатель</strong> – физическое лицо, индивидуальный предприниматель или юридическое лицо, намеренное
    купить Товар у Агента. </p>
<p class="contract__p">2.13. <strong>Пользователь</strong> – физическое лицо, действующее в интересах юридического лица или индивидуального
    предпринимателя - Принципала, прошедшее регистрацию на Сайте и получившее Учетную запись.</p>
<p class="contract__p">2.14. <strong>Пользовательское соглашение</strong> – соглашение между правообладателем Платформы и Пользователями,
    условия которого размещены на Сайте в информационно-коммуникационной сети «Интернет» по адресу:
    {{ env('APP_URL') }}.</p>
<p class="contract__p">2.15. <strong>Продавец</strong> – юридическое лицо или индивидуальный предприниматель, осуществляющие продажу Товара
    Агенту. </p>
<p class="contract__p">2.16. <strong>Сайт</strong> - веб-страница, доступная в информационно-телекоммуникационной сети «Интернет» по адресу:
    {{ env('APP_URL') }}, обеспечивающая удаленный доступ Принципала к Платформе и являющаяся составной частью
    Платформы.</p>
<p class="contract__p">2.17. <strong>Товар</strong> – товары определенных категорий по выбору Агента, сделки с которыми совершает Агент.
</p>
<p class="contract__p">2.18. <strong>Условия поручения</strong> – совокупность условий, включающая Период поручения, размер Платежа на
    закупку Товара, Наценку и других условий, на которых Принципал дает поручение Агенту по Договору, определяемых в
    Приложении № 1 к Оферте.</p>
<p class="contract__p">2.19. <strong>Учетная запись</strong> – совокупность данных о Принципале, зафиксированная в цифровом формате и
    необходимая для аутентификации Принципала и предоставления доступа к Личному кабинету.</p>
<p class="contract__p">2.20. <strong>Цена продажи</strong> – цена, по которой была совершена сделка с Покупателем.</p>
<p class="contract__p">2.21. <strong>Цикл закупки</strong> – срок, составляющий 1 календарный месяц, в течение которого Агент совершает
    закупку и продажу Товара. Цикл закупки начинает течь с момента акцепта Оферты.</p>
<h5 class="contract__h5">3. ПРЕДМЕТ И ПОРЯДОК ИСПОЛНЕНИЯ ДОГОВОРА</h5>
<p class="contract__p">3.1. Принципал поручает, а Агент принимает на себя обязательства от своего имени и за счет Принципала совершать
    следующие фактические и юридические действия:</p>
<p class="contract__p">3.1.1. Совершать сделки с Продавцами по покупке Товара на наиболее выгодных для Принципала условиях; </p>
<p class="contract__p">3.1.2. Совершать сделки с Покупателями по продаже Товара на наиболее выгодных для Принципала условиях;</p>
<p class="contract__p">3.1.3. Осуществлять коммуникацию с Продавцами и Покупателями, направленную на организацию совершения сделок;</p>
<p class="contract__p">3.1.4. Определять по своему усмотрению Продавцов, Покупателей, ассортимент и количество Товара;</p>
<p class="contract__p">3.1.5. Не позднее 5 (пяти) рабочих дней после завершения Периода поручения Агент обязуется по выбору Принципала:</p>
<p class="contract__p">3.1.5.1. в случае прекращения действия Договора, перечислить Принципалу Выручку (Платеж на закупку Товара и Ожидаемую
    прибыль Принципала за оставшийся период) за вычетом Вознаграждения Агента и сумм ранее выплаченной Ожидаемой прибыли
    Принципала, или</p>
<p class="contract__p">3.1.5.2. в случае продолжения действия Договора на тех же условиях и на тот же период, перечислить Принципалу только
    Ожидаемую прибыль Принципала за оставшийся Период, и направить оставшиеся средства на закупку Товара в следующем
    Периоде.</p>
<p class="contract__p">3.2. Поручение Агента считается исполненным, если вследствие действий Агента Товар был продан Покупателям по цене не
    ниже Минимальной цены продажи.</p>
<p class="contract__p">3.3. В свою очередь Принципал обязуется:</p>
<p class="contract__p">3.3.1. Перевести Агенту на расчетный счет Платеж на закупку Товара в размере, определенном Принципалом в соответствии
    с выбранными Условиями поручения, не позднее 5 (пяти) рабочих дней с момента генерации платежного поручения на
    оплату в Личном кабинете;</p>
<p class="contract__p">3.3.2. Своевременно и в полном объеме выплачивать Агенту вознаграждение.</p>
<h5 class="contract__h5">4. ВОЗНАГРАЖДЕНИЕ АГЕНТА И ПОРЯДОК ОПЛАТЫ</h5>
<p class="contract__p">4.1. За выполнение поручения, предусмотренного п. 3.1. Оферты Принципал выплачивает Агенту вознаграждение, размер
    которого составляет 100% Дополнительной выгоды («Вознаграждение Агента»).</p>
<p class="contract__p">4.2. Выплата Вознаграждения Агента осуществляется путем удержания Агентом причитающейся ему суммы Вознаграждения в
    соответствии с п. 3.1.5 Договора с периодичностью, определенной в зависимости от выбранных Принципалом Условий
    поручения (Приложение № 1 к Оферте). </p>
<p class="contract__p">4.3. Все расчёты по настоящему Договору между Сторонами производятся в валюте Российской Федерации.</p>
<p class="contract__p">4.4. Стороны договорились, что любые авансы, предварительные оплаты, отсрочки и рассрочки платежей в рамках
    настоящего Договора не являются коммерческим кредитом по смыслу ст. 823 Гражданского кодекса Российской Федерации и
    не дают кредитору право на получение с должника процентов на сумму долга за период пользования денежными средствами
    в соответствии со ст. 317.1 Гражданского кодекса Российской Федерации.</p>
<h5 class="contract__h5">5. КОНФИДЕНЦИАЛЬНОСТЬ</h5>
<p class="contract__p">5.1. Стороны обязуются не разглашать третьим лицам информацию, которая стала им известной в результате реализации
    прав и исполнения обязанностей по настоящему Договору (Конфиденциальная информация).</p>
<p class="contract__p">5.2. Конфиденциальной считается любая информация, которую сторона прямо относит к таковой и заведомо предупреждает
    другую сторону о конфиденциальном характере такой информации, в том числе путём проставления штампа «секретно»,
    «конфиденциально» и т.п. в отношении документов на бумажных носителях либо путём прямого указания на
    конфиденциальность такой информации в случае передачи электронных документов, в том числе электронных писем.</p>
<p class="contract__p">5.3. При передаче Конфиденциальной информации каждая из Сторон подтверждает и гарантирует, что:</p>
<p class="contract__p">5.3.1. Она является законным владельцем всей Конфиденциальной информации, передаваемой ею во исполнение настоящего
    Договора;</p>
<p class="contract__p">5.3.2. Вся Конфиденциальная информация получена законным образом, и Сторона имеет все права на передачу такой
    Конфиденциальной информации;</p>
<p class="contract__p">5.3.3. Передаваемая Конфиденциальная информация не составляет государственную тайну Российской Федерации, и ее
    передача не является нарушением законодательства Российской Федерации.</p>
<p class="contract__p">5.4. Каждая из Сторон обязуется обеспечить защиту Конфиденциальной информации и не допускать разглашения полученной
    Конфиденциальной информации в порядке, предусмотренном настоящим Договором и законодательством Российской Федерации.
</p>
<p class="contract__p">5.5. Для обеспечения сохранности Конфиденциальной информации Стороны обязуются:</p>
<p class="contract__p">5.5.1. Соблюдать в отношении Конфиденциальной информации, полученной от другой Стороны, такой же режим
    конфиденциальности, как и в отношении своей собственной Конфиденциальной информации.</p>
<p class="contract__p">5.5.2. Самостоятельно определять способы защиты Конфиденциальной информации, кроме способов, которые Сторона обязана
    применять в соответствии с настоящим Договором или действующим законодательством Российской Федерации.</p>
<p class="contract__p">5.5.3. Не разглашать Конфиденциальную информацию, а также в одностороннем порядке не прекращать действие режима
    конфиденциальности.</p>
<p class="contract__p">5.5.4. Без письменного согласия Стороны, предоставившей Конфиденциальную информацию, не использовать Конфиденциальную
    информацию в личных целях и не передавать ее третьим лицам, как в период действия настоящего Договора, так и в
    течение пяти лет после прекращения действия настоящего Договора.</p>
<p class="contract__p">5.5.5. Незамедлительно сообщить Стороне, предоставившей Конфиденциальную информацию, о допущенном другой Стороной
    либо ставшем ей известном факте разглашения, незаконном получении или незаконном использовании Конфиденциальной
    информации третьими лицами.</p>
<p class="contract__p">5.5.6. Немедленно уведомить в письменной форме Сторону, предоставившую Конфиденциальную информацию, о поступлении
    запроса или требовании о предоставлении или передаче Конфиденциальной информации от уполномоченных государственных
    органов, направленного в случае и порядке, предусмотренных федеральными законами Российской Федерации, с указанием
    объема и характера передаваемой информации.</p>
<p class="contract__p">5.6. Сторона, допустившая разглашение Конфиденциальной информации, обязана уплатить
    другой Стороне штраф в размере 100 000 (сто тысяч) руб., не позднее 3 (трех) рабочих дней с момента получения
    письменного требования об уплате штрафа. Оплата штрафа производится по реквизитам, указанным в настоящем Договоре.
    Сверх указанной суммы штрафа с нарушившей Стороны могут быть взысканы убытки, понесенные другой Стороной Договора
    вследствие разглашения Конфиденциальной информации.</p>
<h5 class="contract__h5">6. ОБСТОЯТЕЛЬСТВА НЕПРЕОДОЛИМОЙ СИЛЫ</h5>
<p class="contract__p">6.1. Стороны освобождаются от ответственности за частичное или полное неисполнение обязательств по настоящему
    Договору, если они докажут, что это неисполнение явилось следствием обстоятельств непреодолимой силы, а именно:
    объявленная или фактическая война, террористические акты, гражданские волнения, эпидемии, блокады, эмбарго, пожары,
    землетрясения, наводнения и другие природные, стихийные бедствия, а также издание актов государственных органов при
    условии, что данные обстоятельства возникли после заключения настоящего Договора и непосредственно повлияли на
    выполнение условий по настоящему Договору.</p>
<p class="contract__p">6.2. Сторона, которая не в состоянии выполнить свои договорные обязательства, незамедлительно информирует другую
    Сторону о начале и прекращении указанных выше обстоятельств.</p>
<p class="contract__p">6.3. Если указанные обстоятельства продолжаются более 3 (трех) месяцев, каждая Сторона имеет право на расторжение
    Договора.</p>
<h5 class="contract__h5">7. АНТИКОРРУПЦИОННАЯ ОГОВОРКА</h5>
<p class="contract__p">7.1. При исполнении своих обязательств по настоящему Договору Стороны, а равно их аффилированные лица, работники или
    посредники, не выплачивают, не предлагают выплатить и не разрешают выплату каких-либо денежных средств или
    ценностей, прямо или косвенно, любым лицам, для оказания влияния на действия или решения этих лиц с целью получить
    какие-либо неправомерные преимущества, иную выгоду, как материальную, так и нематериальную.</p>
<p class="contract__p">7.2. При исполнении своих обязательств по настоящему Договору Стороны, а равно их аффилированные лица, работники или
    посредники, не осуществляют действия, квалифицируемые законодательством, как дача и/или получение взятки,
    коммерческий подкуп, а также действия, нарушающие требования применимого законодательства и/или международных актов
    о противодействии легализации (отмыванию) доходов, полученных преступным путем, включая, но не ограничиваясь,
    Конвенцией Совета Европы об отмывании, выявлении, изъятии и конфискации доходов от преступной деятельности и о
    финансировании терроризма от 16.05.2005 года и Конвенцией ООН против коррупции от 31.10.2003 года.</p>
<p class="contract__p">7.3. В случае возникновения у Стороны подозрений, что произошло или может произойти нарушение каких-либо положений
    настоящего раздела, соответствующая Сторона обязуется уведомить другую Сторону в письменной форме. После письменного
    уведомления, соответствующая Сторона имеет право приостановить исполнение обязательств по настоящему Договору до
    получения подтверждения, что нарушения не произошло или не произойдет. Такое подтверждение должно быть направлено в
    течение десяти рабочих дней с даты получения письменного уведомления.</p>
<p class="contract__p">7.4. В письменном уведомлении Сторона обязана сослаться на факты и, при их наличии, предоставить материалы,
    достоверно подтверждающие или дающие основание предполагать, что произошло или может произойти нарушение каких-либо
    положений настоящего раздела контрагентом, его аффилированными лицами, работниками или посредниками выражающееся в
    действиях, квалифицируемых как дача или получение взятки, коммерческий подкуп, а также действиях, нарушающих
    требования применимого законодательства и международных актов о противодействии легализации доходов, полученных
    преступным путем.</p>
<h5 class="contract__h5">8. СРОК ДЕЙСТВИЯ ДОГОВОРА И ПОРЯДОК ВНЕСЕНИЯ ИЗМЕНЕНИЙ</h5>
<p class="contract__p">8.1. Настоящий Договор вступает в силу с момента акцепта Оферты и действует в течение Периода поручения.</p>
<p class="contract__p">8.2. За 2 (два) месяца до завершения Периода поручения в Личном кабинете Принципала появляется возможность выбрать
    одно из действий, предусмотренных в п. 3.1.5 Оферты. В случае если Принципал не выбирает ни одно из действий по
    завершении Периода поручения, действует п. 3.1.5.2 Оферты, а Оферта считается продленной на такой же Период
    поручения на тех же Условиях поручения.</p>
<p class="contract__p">8.3. Договор может быть расторгнут досрочно по инициативе Принципала посредством Личного кабинета. В этом случае
    происходит пересчет причитающихся Принципалу выплат в соответствии с Условиями поручения.</p>
<p class="contract__p">8.4. Внесение изменений в настоящую Оферту производится Агентом в одностороннем порядке. Оферта в новой редакции
    действует только для тех Принципалов, которые акцептовали Оферту после внесения в нее изменений.</p>
<p class="contract__p">8.5. Договор может быть расторгнут по инициативе Агента. В этом случае Агент обязан уведомить Принципала о
    расторжении не менее чем за 10 (десять) календарных дней до предполагаемой даты расторжения Договора, путем
    направления уведомления об одностороннем отказе от настоящего Договора.</p>
<h5 class="contract__h5">9. ОТВЕТСТВЕННОСТЬ СТОРОН </h5>
<p class="contract__p">9.1. Стороны несут ответственность за неисполнение либо ненадлежащее исполнение принятых на себя по настоящему
    Договору обязательств в соответствии с гражданским законодательством Российской Федерации.</p>
<p class="contract__p">9.2. Принципал отвечает за достоверность информации, предоставляемой Агенту при заполнении электронной формы на
    Сайте.</p>
<h5 class="contract__h5">10. ПРОЧИЕ ПОЛОЖЕНИЯ</h5>
<p class="contract__p">10.1. Стороны не вправе уступать свои права и обязанности по настоящему Договору третьим лицам.</p>
<p class="contract__p">10.2. Информирование Принципала в рамках исполнения настоящего Договора, а также направление документов
    осуществляется Агентом в Личном кабинете Принципала, а если по каким-либо причинам это невозможно, то по электронной
    почте, указанной Принципалом при заполнении электронной формы согласно п. 1.4 Договора. </p>
<p class="contract__p">10.3. Проверка электронной почты, указанной Принципалом при заполнении электронной формы, является обязанностью
    Принципала. Принципал не может ссылаться на свою неосведомленность в случае, если информация была направлена Агентом
    в Личном кабинете или на указанную Принципалом при заполнении электронной формы электронную почту.</p>
<p class="contract__p">10.4. Стороны могут договориться об обмене оригиналами документов, но по умолчанию документы, направленные по
    электронной почте в виде скан-копий, подписанных уполномоченными лицами, документов имеют юридическую силу
    документов на бумажном носителе.</p>
<p class="contract__p">10.5. Стороны в пятидневный срок уведомляют друг друга обо всех изменениях своих юридических и других данных, которые
    могут повлиять на исполнение настоящего Договора. В случае нарушения этого условия направление сообщения Стороне по
    ее прежнему адресу будет считаться выполненным в соответствии с настоящим Договором надлежащим образом.</p>
<p class="contract__p">10.6. В случае если какое-либо положение настоящего Договора становится недействительным на основании закона или по
    решению суда, это не влияет на действительность всех иных его положений.</p>
<p class="contract__p">10.7. Все споры и разногласия, связанные с заключением, изменением, расторжением, толкованием и исполнением
    настоящего Договора, разрешаются Сторонами с соблюдением досудебного претензионного порядка разрешения спора.
    Возникшие разногласия и споры по настоящему Договору разрешаются путем обмена письмами (претензиями) между Сторонами
    по электронной почте. Срок рассмотрения претензии Стороной – не более 15 (пятнадцати) календарных дней с момента
    получения. В случае если Стороны не придут к соглашению либо ответ на претензию не будет получен заинтересованной
    Стороной в срок, установленный настоящим пунктом, соответствующий спор передается на рассмотрение в Арбитражный суд
    города Москвы.</p>
<p class="contract__p">10.8. В случае противоречия положений Договора и Условий поручения, следует руководствоваться положениями Условий
    поручения.</p>
<h5 class="contract__h5">11. АДРЕС И РЕКВИЗИТЫ АГЕНТА</h5>
<p class="contract__p">Агент:</p>
<table class="contract__table" style="width: 50%;">
    <tr>
        <td style="text-align:left">{{ settings()->organization_title }}</td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">Адрес места нахождения: {{ settings()->legal_address }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">ОГРН: {{ settings()->ogrn }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">ИНН/КПП: {{ settings()->inn }}/{{ settings()->kpp }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">р/с: {{ settings()->payment_account }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">в {{ settings()->bank }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">БИК: {{ settings()->bik }}</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">к/с: {{ settings()->correspondent_account }}</p>
        </td>
    </tr>
    <tr>
        {{-- //TODO email tel --}}
        <td style="text-align:left">
            <p class="contract__p">Эл.почта_______________________</p>
        </td>
    </tr>
    <tr>
        <td style="text-align:left">
            <p class="contract__p">Телефон:</p>
        </td>
    </tr>
</table>
{{-- //TODO --}}
<p class="contract__page-break">Редакция от «__» _____2023 г.</p>

<h4 class="contract__h4">Приложение № 1 к Оферте</h4>
<h4 class="contract__h4">Условия поручения (далее – «Условия»)</h4>
<p class="contract__p">1. Принципал в Личном кабинете выбирает один из следующих вариантов Условий поручения:</p>
@foreach ($tariffs as $name => $group)
    <h5 class="contract__h5">1.{{ $loop->iteration }}. Условия поручения №{{ $loop->iteration }}
        ({{ $name }}).</h5>
    <div class="contract__table-wrap">
        <table class="contract__table">
            <thead>
                <tr>
                    <th>Период поручения (мес.)</th>
                    <th>Размер Платежа на закупку Товара (руб.)</th>
                    <th>Наценка в рамках одного Цикла закупки (1 мес. / проценты, %)</th>
                    <th>Периодичность выплат Ожидаемой прибыли Принципала</th>
                </tr>
            </thead>
            <tbody>
                @foreach ($group as $tariff)
                    <tr>
                        <td>{{ $tariff->duration }}</td>
                        <td>
                            <span style="white-space: nowrap">
                                от&nbsp;{{ number_format($tariff->min_amount->amount(), 0, ',', ' ') }}
                            </span>
                            @if ($tariff->max_amount->raw() !== 0)
                                <span style="white-space: nowrap">
                                    до&nbsp;{{ number_format($tariff->max_amount->amount(), 0, ',', ' ') }}
                                </span>
                            @endif
                        </td>
                        <td>{{ number_format($tariff->annual_rate / 12, 2, ',', ' ') }}</td>
                        <td>
                            @if ($tariff->getting_profit === $tariff::AT_THE_END)
                                в конце Периода поручения
                            @endif
                            @if ($tariff->getting_profit === $tariff::MONTHLY)
                                ежемесячно
                            @endif
                        </td>
                    </tr>
                @endforeach
            </tbody>
        </table>
    </div>
@endforeach
<p class="contract__p">2. Принципал, посредством подачи заявки в Личном кабинете, имеет возможность внести следующие изменения:</p>
<p class="contract__p">2.1. Продлить Период поручения в рамках действующих Условий поручения на следующий Период поручения (п. 3.1.5.2
    договора);</p>
<p class="contract__p">2.2. Увеличить размер Платежа на закупку Товара в рамках действующих Условий поручения;</p>
<p class="contract__p">2.3. Выбрать другие Условия поручения, при условии, что смена происходит в сторону Условий поручения с большей
    Наценкой.</p>
<p class="contract__p">3. Изменения, предусмотренные в п. 2 Условий, вступают в силу со следующего Цикла закупки после подачи заявки и
    внесения необходимой доплаты Платежа на закупку Товара (если она требуется).</p>
<p class="contract__p">4. При увеличении Платежа на закупку Товара в рамках Условий поручения №1, №2, №3, Ожидаемая прибыль Принципала
    изменяется только со следующего Цикла закупки.</p>

<p class="contract__p">5. При увеличении Платежа на закупку Товара в рамках Условий поручения №4 и №5, пересчитывается сумма Ожидаемой
    прибыли Принципала только за оставшийся Период поручения (за предыдущий Период поручения сумма Ожидаемой прибыли
    Принципала не пересчитывается).</p>
<p class="contract__p">6. При смене Условий поручения с ежемесячными выплатами Ожидаемой прибыли Принципала (Условия поручения №1, №2, №3)
    на иные Условия поручения (изменения возможны только с повышением Наценки) происходит изменение Наценки и Ожидаемой
    прибыли Принципала только со следующего Цикла закупки. Ожидаемая прибыль Принципала за прошедшие Циклы закупки не
    пересчитывается.</p>
<p class="contract__p">7. При смене Условий поручения с выплатой Ожидаемой прибыли Принципала в конце Периода поручения (Условия поручения
    №4, №5 / изменения возможны только с повышением Наценки) Ожидаемая прибыль Принципала пересчитывается и за прошедшие
    ранее Циклы закупки.</p>
<p class="contract__p">8. В случае досрочного расторжения Договора по инициативе Принципала, при действии Условий поручения №1, №2, №3,
    Принципалу выплачивается Платеж на закупку Товара и Выручка, полученная на дату расторжения Договора, за вычетом
    сумм Ожидаемой прибыли Принципала, ранее выплаченных Принципалу в течение действия Договора и Агентского
    вознаграждения.</p>
<p class="contract__p">9. В случае досрочного расторжения Договора по инициативе Принципала, при действии Условий поручения №4, №5,
    Принципалу выплачивается Платеж на закупку Товара. Ожидаемая прибыль Принципала при этом выплате не подлежит. </p>
<p class="contract__p">10. В случае досрочного расторжения Договора по инициативе Агента, Принципалу выплачивается Платеж на закупку Товара
    и Ожидаемая прибыль Принципала за прошедший Период поручения на дату расторжения Договора (независимо от действующих
    Условий поручения), за вычетом сумм Ожидаемой прибыли Принципала, ранее выплаченных Принципалу в течение действия
    Договора и Агентского вознаграждения.</p>
